/*********************************************************************************************************
* 文件名称：LEDSDApp.c
* 摘    要：单个数码管驱动
* 当前版本：1.0.0
* 作    者：阿顿
* 完成日期：
* 内    容：
* 注    意：
* 开发环境：STC8A8K64S4A12@22.1184MHz芯片 & Keil uVision 5                                                                 
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef __LEDSDApp_c_
#define __LEDSDApp_c_

#define out_T_off 0x00
#define out_T_on 0x01
#define out_P_off 0x00//正向
#define out_P_on 0x01//反向
#define LEDSDIO P0

u8 code ledsddata[]={0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0x88,0x83,0xC6,0xA1,0x86,0x8E,0x89,0xC7,0xC8,0xC1,0x8C,0xA3,0xBF,0xFF};
void out_LEDSD(u8 out_value,u2 out_type,u2 out_path);

#endif
