/*********************************************************************************************************
* 文件名称：DS18B20App.c
* 摘    要：DS18B20初始化/读取DS18B20温度值
* 当前版本：1.0.0
* 作    者：阿顿
* 完成日期：
* 内    容：
* 注    意：
* 开发环境：STC8A8K64S4A12@22.1184MHz芯片 & Keil uVision 5                                                                 
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

#include"Basic.h"
#include"DS18B20App.h"
#include"DS18B20.h"

/********************************
函数名称:DS18B20_Init
函数功能:DS18B20初始化
输入参数:
输    入:
输出参数:
输    出:
********************************/
void DS18B20_Init()
{
	EA = 0;//关闭所有中断
	DS_Init();
	DS_Write(0xcc);//发送跳跃ROM指令
	DS_Write(0x4e);//写暂存器指令
	DS_Write(0x7f);
	DS_Write(0xf7);
	DS_Write(0xff);//配置工作在9位模式下
	DS_Init();//初始化DS18B20
	DS_Write(0xcc);//发送跳跃ROM指令 
	DS_Write(0x48);
	EA = 1;//恢复所有中断
}
/********************************
函数名称:DS18B20C
函数功能:读取DS18B20温度值
输入参数:
输    入:
输出参数:DS18B20温度值
输    出:
********************************/
u16 in_DS18B20()
{
	u16 C;
	EA = 0;//关闭所有中断
	DS_Init();//初始化DS18B20
	DS_Write(0xcc);//发送跳跃ROM指令
	DS_Write(0x44);//发送温度转换指令
	DS_Init();//初始化DS18B20
	DS_Write(0xcc);//发送跳跃ROM指令
	DS_Write(0xbe);//读取DS18B20暂存器值
	C = DS_Read();
	C = C |(DS_Read() << 8);
	EA = 1;//恢复所有中断
	if(C == 0xFFFF)
		return 0;
	else
		return (C * 0.0625 * 10 + 0.5);
}
