/*********************************************************************************************************
* 文件名称：LEDDMDApp.c
* 摘    要：1602字符串输出595芯片驱动点阵屏/I/O口驱动点阵屏
* 当前版本：1.0.0
* 作    者：阿顿
* 完成日期：
* 内    容：
* 注    意：
* 开发环境：STC8A8K64S4A12@22.1184MHz芯片 & Keil uVision 5                                                                 
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

#include"Basic.h"
#include"LEDDMDApp.h"
#include"74HC595.h"

/********************************
函数名称:out595_LEDDMD
函数功能:595芯片驱动点阵屏
输入参数:dat(数据),address(地址),spin_flag(开启反转)
输    入:
输出参数:
输    出:
********************************/
void out595_LEDDMD(u8 dat,u8 address,u2 spin_flag)
{
 	if(spin_flag)//开启旋转
	{
		SendByte595(~dat);
		SendByte595(0x01 << address);
	}
	else//未开启旋转
	{
		SendByte595(~(0x80 >> address));
		SendByte595(dat);
	}
	R_CLK_74HC595 = 1;//产生下降沿,使595芯片输出
	R_CLK_74HC595 = 0;
}
/********************************
函数名称:outio_LEDDMD
函数功能:I/O口驱动点阵屏
输入参数:dat(数据),address(地址),spin_flag(开启反转)
输    入:
输出参数:
输    出:
********************************/
void outio_LEDDMD(u8 dat,u8 address,u2 spin_flag)
{
 	if(spin_flag)//开启旋转
	{
		addressIO = dat;
		datIO = ~(0x80 >> address);
	}
	else//未开启旋转
	{
		addressIO = (0x01 << address);
		datIO = ~dat;
	}
}
